In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'name':['Adam', 'Bob', 'Dave', 'Fred'],
                  'age': [15, 16, 16, 15],
                  'test1': [95, 81, 89, None],
                  'test2': [80, 82, 84, 88],
                  'teacher': ['Ashby', 'Ashby', 'Jones', 'Jones']})

In [3]:
df

   age  name teacher  test1  test2
0   15  Adam   Ashby   95.0     80
1   16   Bob   Ashby   81.0     82
2   16  Dave   Jones   89.0     84
3   15  Fred   Jones    NaN     88

In [4]:
df.groupby('teacher').describe()

          age                                                 test1        \
        count  mean       std   min    25%   50%    75%   max count  mean
teacher
Ashby     2.0  15.5  0.707107  15.0  15.25  15.5  15.75  16.0   2.0  88.0
Jones     2.0  15.5  0.707107  15.0  15.25  15.5  15.75  16.0   1.0  89.0

         ...              test2
         ...    75%   max count  mean       std   min   25%   50%   75%   max
teacher  ...
Ashby    ...   91.5  95.0   2.0  81.0  1.414214  80.0  80.5  81.0  81.5  82.0
Jones    ...   89.0  89.0   2.0  86.0  2.828427  84.0  85.0  86.0  87.0  88.0

[2 rows x 24 columns]

In [5]:
df.groupby('teacher').median()

          age  test1  test2
teacher
Ashby    15.5   88.0   81.0
Jones    15.5   89.0   86.0

In [6]:
df.groupby(['teacher', 'age']).median()

             test1  test2
teacher age
Ashby   15    95.0     80
        16    81.0     82
Jones   15     NaN     88
        16    89.0     84

In [7]:
df.groupby(['teacher', 'age']).count()

             name  test1  test2
teacher age
Ashby   15      1      1      1
        16      1      1      1
Jones   15      1      0      1
        16      1      1      1

In [8]:
df.groupby(['teacher', 'age']).max()

             name  test1  test2
teacher age
Ashby   15   Adam   95.0     80
        16    Bob   81.0     82
Jones   15   Fred    NaN     88
        16   Dave   89.0     84